IRP/src/Catalogs/SystemAttributesSets/SystemAttributesSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SystemAttributesSets</name>
  <predefined>
    <items>
      <name>Document_SalesOrder</name>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
    </items>
    <items>
      <name>Document_SalesReturnOrder</name>
    </items>
    <items>
      <name>Document_SalesReturn</name>
    </items>
    <items>
      <name>Document_ShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
    </items>
    <items>
      <name>Document_PurchaseInvoice</name>
    </items>
    <items>
      <name>Document_PurchaseReturn</name>
    </items>
    <items>
      <name>Document_PurchaseReturnOrder</name>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
    </items>
    <items>
      <name>Document_RetailGoodsReceipt</name>
    </items>
    <items>
      <name>Document_RetailReceiptCorrection</name>
    </items>
    <items>
      <name>Document_RetailReturnReceipt</name>
    </items>
    <items>
      <name>Document_RetailSalesReceipt</name>
    </items>
    <items>
      <name>Document_RetailShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_PurchaseOrderClosing</name>
    </items>
    <items>
      <name>Document_SalesOrderClosing</name>
    </items>
    <items>
      <name>Document_CommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_DecommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_ModernizationOfFixedAsset</name>
    </items>
    <items>
      <name>Document_ShipmentPlaningOrder</name>
    </items>
    <items>
      <name>Document_PlannedReceiptReservation</name>
    </items>
  </predefined>
  <tabularSections>
    <name>Attributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.SystemAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Collection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/SystemAttributesSets/ManagerModule.bsl
// @strict-types

// Check and fill set predefined value.
// 
// Parameters:
//  SetRef - CatalogRef.SystemAttributesSets - Set
//  Clearing - Boolean - Clearing
Procedure CheckFillSetPredefinedValue(SetRef, Clearing = False) Export
	
	PredefinedName = SetRef.PredefinedDataName;
	If IsBlankString(PredefinedName) Then
		Return;
	EndIf;
	
	NameSegments = StrSplit(PredefinedName, "_");
	MetadataTypeName = NameSegments[0];
	MetadataObjectName = NameSegments[1];
	
	SystemAttributes = New Array; // Array of ChartOfCharacteristicTypesRef.SystemAttributes
	If MetadataTypeName = "Document" Then
		//@skip-check dynamic-access-method-not-found, statement-type-change
		SystemAttributes = Documents[MetadataObjectName].GetPredefinedSystemAttributes();
	ElsIf MetadataTypeName = "Catalog" Then
		//@skip-check dynamic-access-method-not-found, statement-type-change
		SystemAttributes = Catalogs[MetadataObjectName].GetPredefinedSystemAttributes();
	EndIf;
	
	SetObject = SetRef.GetObject();
	If Clearing Then
		SetObject.Attributes.Clear();
	EndIf;
	
	NeedToSave = False;
	For Each SystemAttribute In SystemAttributes Do
		If SetObject.Attributes.Find(SystemAttribute, "Attribute") = Undefined Then
			SystemAttributeRecord = SetObject.Attributes.Add();
			SystemAttributeRecord.Attribute = SystemAttribute;
			SystemAttributeRecord.Collection = True;
			NeedToSave = True;
		EndIf;
	EndDo;
	
	If NeedToSave Then
		SetObject.Write();
	EndIf;
	
EndProcedure
